In [1]:
import pandas as pd

In [91]:
friend_dict_list=[
    {"name":"John",
    "age":25,
    "job":"student"},
    {"name":"Nate",
    "age":30,
    "job":"teacher"},
    {"name":"Jenny",
    "age":30,
    "job":"developer"},
]

friend_df = pd.DataFrame(friend_dict_list)
friend_df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [4]:
# 딕셔너리 구조로 컬럼값== 키값
score_dict={"국어":[15,25,35],"영어":[45,55,65],"수학":[75,85,95]}
student_df = pd.DataFrame(score_dict)
student_df

   국어  영어  수학
0  15  45  75
1  25  55  85
2  35  65  95

In [5]:
#인덱스 값 부여

person_df = pd.DataFrame(friend_dict_list, index=["f1","f2","f3"])
person_df

     name  age        job
f1   John   25    student
f2   Nate   30    teacher
f3  Jenny   30  developer

In [6]:
month_df = pd.DataFrame(score_dict, index=["1월","2월","3월"])
month_df

    국어  영어  수학
1월  15  45  75
2월  25  55  85
3월  35  65  95

In [7]:
# 리스트 구조로 컬럼명, 인덱스값 지정하기

list = [[1,2,3,4,5],[6,7,8,9,10]]

two_df = pd.DataFrame(list, index=["내용1","내용2"], columns=["c1","c2","c3","c4","c5"])
two_df

     c1  c2  c3  c4  c5
내용1   1   2   3   4   5
내용2   6   7   8   9  10

In [11]:
# pandas에서 csv 파일 불러오기
# 그냥 불러오면 컬럼값으로 당겨지기 때문에 header=None으로 지정
# names=[] 컬럼명 지정

df = pd.read_csv("./data/sample1.csv", header=None, names=["c1","c2","c3"])
df

   c1  c2  c3
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15
5  16  17  18

In [14]:
# csv는 기본 ,콤마로 구분되어 있다. |로 구분되어있는 파일을 열려면 delimiter지정

df = pd.read_csv("./data/sample2.csv", header=None, delimiter="|")
df

     0    1                    2   3
0   번호   이름                 가입일시  나이
1    1  김정수  2017-01-19 11:30:00  25
2    2  박민구  2017-02-07 10:22:00  35
3    3  정순미  2017-01-22 09:10:00  33
4    4  김정현  2017-02-22 14:09:00  45
5    5  홍미진  2017-04-01 18:00:00  17
6    6  김순철  2017-05-14 22:33:07  22
7    7  이동철  2017-03-01 23:44:45  27
8    8  박지숙  2017-01-11 06:04:18  30
9    9  김은미  2017-02-08 07:44:33  51
10  10  장혁철  2017-12-01 13:01:11  16

In [18]:
# 인덱스 칼럼으로 쓸 경우

df = pd.read_csv("./data/sample2.csv", header=None, delimiter="|", index_col=0)
df

      1                    2   3
0
번호   이름                 가입일시  나이
1   김정수  2017-01-19 11:30:00  25
2   박민구  2017-02-07 10:22:00  35
3   정순미  2017-01-22 09:10:00  33
4   김정현  2017-02-22 14:09:00  45
5   홍미진  2017-04-01 18:00:00  17
6   김순철  2017-05-14 22:33:07  22
7   이동철  2017-03-01 23:44:45  27
8   박지숙  2017-01-11 06:04:18  30
9   김은미  2017-02-08 07:44:33  51
10  장혁철  2017-12-01 13:01:11  16

In [22]:
# 엑셀파일 읽어오기

excel_df = pd.read_excel("./data/train.xlsx")
excel_df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [21]:
sample_df = pd.read_excel("./data/sample.xlsx")
sample_df

   Sap Co.        대리점 영업사원       전월       금월  TEAM  총 판매수량
0   KI1316    경기수원대리점  이기정  1720000  2952000     1     123
1   KI1451    충청홍성대리점  정미진  4080000  2706000     2     220
2   KI1534    경기화성대리점  경인선   600000  2214000     1     320
3   KI1636    강원속초대리점  이동권  3720000  2870000     3     110
4   KI1735    경기안양대리점  강준석  4800000  2296000     1     134
5   KI1875   제주제주시대리점  민경수  3420000  2346000     4     210
6   KI1917    경기광주대리점  김진혜  1292000  1518000     1     110
7   KI2032    경기평택대리점  고유정  2736000  2139000     2      90
8   KI2153   경기의정부대리점  김은향  1368000  2484000     1     183
9   KI2214    경기성남대리점  이준수  1976000  1518000     3      73
10  KI2313  제주서귀포시대리점  온지수   152000   945000     1      52
11  KI2433    경기계양대리점  이희영  1833000  1404000     1     110
12  KI2512    경기평촌대리점  강백호  4320000  2312000     3     240
13  KI2671  제주서귀포시대리점  주은명  4040000  4760000     4      50
14  KI2776   경기남양주대리점  김수진  8160000  4352000     2     354
15  KI2870   경기구리시대리점  박진형  6000000  3400000     2     143
16  KI2910    강원춘천대리점  김은향  4800000  4896000     1     176
17  KI3030    강원영동대리점  전수창  4560000  3128000     2      98
18  KI3131    경기하남대리점  김민정  2750000  7268000     3     293
19  KI3252    강원포천대리점  서가은  2420000  4740000     4     240

In [24]:
friend_df[1:3] #1-3번 읽기(끝자리 포함하지 않음)

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [25]:
friend_df["name"] #name 컬럼만 읽기, 한개의 열이기때문에 시리즈 형태로 반환

0     John
1     Nate
2    Jenny
Name: name, dtype: object

In [26]:
friend_df["age"]

0    25
1    30
2    30
Name: age, dtype: int64

In [27]:
friend_df.loc[[1,2]] #loc[[]] 인덱스 번호를 지정하여 조회할 경우

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [29]:
friend_df.loc[0:1] #범위를 지정하여 조회할 경우 (끝번호 포함)

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [30]:
#~.loc[[행],[열]] 

friend_df.loc[[0,2],["name","job"]]

    name        job
0   John    student
2  Jenny  developer

In [31]:
# 0번행 정보 가져오기-시리즈 데이터 형태로 반환

friend_df.iloc[0]

name       John
age          25
job     student
Name: 0, dtype: object

In [32]:
friend_df.iloc[1,0] #1번행의 0번 컬럼

'Nate'

In [33]:
friend_df.iloc[0:2] #범위 지정시 끝번호 포함시키지 않음

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [34]:
friend_df.iloc[[0,1]] #행 번호 지정하여 가져올때

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [35]:
friend_df.iloc[0:2,0] #0~1번행과 0번 컬럼 조회

0    John
1    Nate
Name: name, dtype: object

In [37]:
friend_df.iloc[0:2,[0,1]]

   name  age
0  John   25
1  Nate   30

In [38]:
student_df

   국어  영어  수학
0  15  45  75
1  25  55  85
2  35  65  95

In [40]:
student_df.loc[2] # 시리즈 형태반환

국어    35
영어    65
수학    95
Name: 2, dtype: int64

In [41]:
student_df[2:3] # 데이터 프레임형태반환

   국어  영어  수학
2  35  65  95

In [42]:
student_df.loc[1,"수학"] #1번행의 수학 컬럼 값 가져오기

85

In [44]:
#student_df.iloc[1,"수학"]

student_df.iloc[1,2]

85

In [45]:
student_df["국어"] #국어 전체컬럼 가져오기

0    15
1    25
2    35
Name: 국어, dtype: int64

In [46]:
month_df

    국어  영어  수학
1월  15  45  75
2월  25  55  85
3월  35  65  95

In [48]:
month_df.loc["2월"] #2월행 조회

국어    25
영어    55
수학    85
Name: 2월, dtype: int64

In [49]:
month_df.iloc[1] #iloc로 2월행 조회

국어    25
영어    55
수학    85
Name: 2월, dtype: int64

In [50]:
month_df.loc["2월":"3월"]

    국어  영어  수학
2월  25  55  85
3월  35  65  95

In [51]:
month_df.iloc[1:3]

    국어  영어  수학
2월  25  55  85
3월  35  65  95

In [52]:
two_df

     c1  c2  c3  c4  c5
내용1   1   2   3   4   5
내용2   6   7   8   9  10

In [54]:
two_df.loc["내용1"]

c1    1
c2    2
c3    3
c4    4
c5    5
Name: 내용1, dtype: int64

In [55]:
two_df.iloc[0]

c1    1
c2    2
c3    3
c4    4
c5    5
Name: 내용1, dtype: int64

In [56]:
two_df.loc["내용1","c1":"c3"]

c1    1
c2    2
c3    3
Name: 내용1, dtype: int64

In [57]:
friend_df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [59]:
friend_df.age > 25 # age가 25인 이상 조회 => True, False 형태로 반환

0    False
1     True
2     True
Name: age, dtype: bool

In [61]:
friend_df[friend_df.age > 25] #조건식을 세워서 조회가능

    name  age        job
1   Nate   30    teacher
2  Jenny   30  developer

In [62]:
friend_df[(friend_df.age > 25) & (friend_df.name == "Nate")] #2개의 조건식 조회

   name  age      job
1  Nate   30  teacher

In [64]:
student_df

   국어  영어  수학
0  15  45  75
1  25  55  85
2  35  65  95

In [65]:
student_df[student_df["국어"] >= 20] #국어점수가 20점 이상 조회

   국어  영어  수학
1  25  55  85
2  35  65  95

In [66]:
friend_df

    name  age        job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [67]:
friend_df.drop([0,2]) #0,2번 삭제(원본데이터는 남아있음)

   name  age      job
1  Nate   30  teacher

In [69]:
friend_df = friend_df.drop([0,2])
friend_df

   name  age      job
1  Nate   30  teacher

In [75]:
friend_df.drop([0,2], inplace=True)
friend_df

   name  age      job
1  Nate   30  teacher

In [83]:
friend_df = friend_df[friend_df.age == 25]  #조건식을 주고 삭제하는 방법
friend_df

   name  age      job
0  John   25  student

In [86]:
friend_df.drop(columns="age") #컬럼명 삭제 (원본있음)

    name        job
0   John    student
1   Nate    teacher
2  Jenny  developer

In [90]:
friend_df.drop("age", axis=1, inplace=True)#컬럼명 삭제 (원본없음)
friend_df

    name        job
0   John    student
1   Nate    teacher
2  Jenny  developer

In [93]:
friend_df.columns=["이름","나이","직업"] #컬럼명 수정
friend_df

      이름  나이         직업
0   John  25    student
1   Nate  30    teacher
2  Jenny  30  developer

In [94]:
friend_df.index=["p1","p2","p3"] #인덱스명 수정
friend_df

       이름  나이         직업
p1   John  25    student
p2   Nate  30    teacher
p3  Jenny  30  developer

In [96]:
friend_df.iloc[1,0] = "Torress" #1번열 0번행 수정
friend_df

         이름  나이         직업
p1     John  25    student
p2  Torress  30    teacher
p3    Jenny  30  developer

In [97]:
friend_df.loc["p4"] = ["Mike",30,"student"] #행 데이터 추가
friend_df

         이름  나이         직업
p1     John  25    student
p2  Torress  30    teacher
p3    Jenny  30  developer
p4     Mike  30    student

In [98]:
friend_df["주소"] = ["서울","부산","경기","대구"] #컬럼 열로 추가
friend_df

         이름  나이         직업  주소
p1     John  25    student  서울
p2  Torress  30    teacher  부산
p3    Jenny  30  developer  경기
p4     Mike  30    student  대구

In [99]:
friend_df.index #index만 출력

Index(['p1', 'p2', 'p3', 'p4'], dtype='object')

In [100]:
friend_df.columns #컬럼만 출력

Index(['이름', '나이', '직업', '주소'], dtype='object')

In [101]:
friend_df.values # 값만 출력

array([['John', 25, 'student', '서울'],
       ['Torress', 30, 'teacher', '부산'],
       ['Jenny', 30, 'developer', '경기'],
       ['Mike', 30, 'student', '대구']], dtype=object)

In [102]:
#데이터 프레임을 csv파일로저장
friend_df.to_csv("./data/friend_df.csv", index=False)

In [103]:
#데이터 프레임을 엑셀파일로저장
friend_df.to_excel("./data/friend_df.xlsx")

In [106]:
# 연습문제

data = {
    "홍길동":[88,75,95],
    "강감찬":[82,62,85],
    "김종민":[75,69,70],
    "임창정":[45,56,80],
}


# 데이터 프레임으로 생성하고 출력하기
# 인덱스명은 java, python, basic으로 지정한다.
data_df = pd.DataFrame(data, index=["java","python","basic"])
data_df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   80

In [108]:
# 홍길동 학생의 과목별 점수를 출력하기
data_df["홍길동"]

java      88
python    75
basic     95
Name: 홍길동, dtype: int64

In [110]:
# python 과목의 점수를 출력하기
data_df.iloc[1]

홍길동    75
강감찬    62
김종민    69
임창정    56
Name: python, dtype: int64

In [111]:
# 임창정 학생의 basic 점수를 78로 수정하고 출력
data_df.iloc[2,3] = 78
data_df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   78

In [113]:
# 각 학생의 sql 점수를 추가하시오 [70,85,86,92]
data_df.loc["sql"]= [70,85,86,92]
data_df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   78
sql      70   85   86   92

In [125]:
# basic 점수를 삭제하시오
data_df.drop("basic")

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
sql      70   85   86   92

In [116]:
# 연습문제

data = {
    "미국":[2.1,2.2,2.3],
    "한국":[0.4,0.5,0.45],
    "중국":[10,13,15],
}

# 인덱스는 2019,2020,2021로 준 후 출력
data1_df = pd.DataFrame(data, index=["2019","2020","2021"])
data1_df

       미국    한국  중국
2019  2.1  0.40  10
2020  2.2  0.50  13
2021  2.3  0.45  15

In [117]:
# 인덱스만 출력하기
data1_df.index

Index(['2019', '2020', '2021'], dtype='object')

In [121]:
# 컬럼명만 출력하기
data1_df.columns

Index(['미국', '한국', '중국'], dtype='object')

In [122]:
# 전체 값들만 출력하기
data1_df.values

array([[ 2.1 ,  0.4 , 10.  ],
       [ 2.2 ,  0.5 , 13.  ],
       [ 2.3 ,  0.45, 15.  ]])

In [123]:
# 미국 컬럼만 출력하기
data1_df["미국"]

2019    2.1
2020    2.2
2021    2.3
Name: 미국, dtype: float64

In [127]:
data = {
    "년도":[2019,2020,2021],
    "미국":[2.1,2.2,2.3],
    "한국":[0.4,0.5,0.45],
    "중국":[10,13,15],
}

df2 = pd.DataFrame(data)
df2

     년도   미국    한국  중국
0  2019  2.1  0.40  10
1  2020  2.2  0.50  13
2  2021  2.3  0.45  15

In [128]:
df2 = df2.set_index("년도") #원하는 컬럼으로 인덱스 지정
df2

       미국    한국  중국
년도
2019  2.1  0.40  10
2020  2.2  0.50  13
2021  2.3  0.45  15

In [130]:
df2 = df2.reset_index("년도") # set 하기 전으로 돌아감
df2

     년도   미국    한국  중국
0  2019  2.1  0.40  10
1  2020  2.2  0.50  13
2  2021  2.3  0.45  15